Revit 2027 API
BuiltInFailures.StairRampFailures.StairsStringerCannotBeCreated Property
 The stairs stringer cannot be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsStringerCannotBeCreated { get; }
Public Shared ReadOnly Property StairsStringerCannotBeCreated As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsStringerCannotBeCreated {
	FailureDefinitionId^ get ();
}
static member StairsStringerCannotBeCreated : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace